{"keras_version": "2.1.2", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 256, 256, 3], "name": "input_1"}}, {"name": "sequential_1", "class_name": "Sequential", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "batch_input_shape": [null, 256, 256, 3], "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}]}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["sequential_1", 1, 0, {}]]], "config": {"name": "dense_1", "kernel_regularizer": null, "units": 1, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "sigmoid"}}]}}