{"keras_version": "2.1.2", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_2", "input_layers": [["input_2", 0, 0]], "output_layers": [["sequential_2", 1, 0]], "layers": [{"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 256, 256, 3], "name": "input_2"}}, {"name": "sequential_2", "class_name": "Sequential", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_12", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "batch_input_shape": [null, 256, 256, 3], "strides": [2, 2], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_13", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [2, 2], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_14", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [2, 2], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_15", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [2, 2], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_16", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [2, 2], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "center": true, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "axis": -1}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_17", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_18", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_19", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_20", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "filters": 256, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_5", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_21", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [4, 4], "bias_constraint": null, "activation": "linear", "filters": 3, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "tanh"}}]}]}}