{"config": {"name": "model_5", "input_layers": [["input_5", 0, 0]], "output_layers": [["sequential_4", 1, 0]], "layers": [{"config": {"name": "input_5", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 256, 256, 3]}, "name": "input_5", "class_name": "InputLayer", "inbound_nodes": []}, {"config": [{"config": {"data_format": "channels_last", "filters": 64, "dtype": "float32", "batch_input_shape": [null, 256, 256, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "name": "conv2d_33", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_33", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_34", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_34", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_35", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_35", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_36", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_36", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_37", "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_37", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"gamma_regularizer": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_constraint": null, "name": "batch_normalization_2", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "center": true}, "class_name": "BatchNormalization"}, {"config": {"size": [2, 2], "name": "up_sampling2d_6", "data_format": "channels_last", "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"data_format": "channels_last", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_38", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_38", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"size": [2, 2], "name": "up_sampling2d_7", "data_format": "channels_last", "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"data_format": "channels_last", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_39", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_39", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"size": [2, 2], "name": "up_sampling2d_8", "data_format": "channels_last", "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"data_format": "channels_last", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_40", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_40", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"size": [2, 2], "name": "up_sampling2d_9", "data_format": "channels_last", "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"data_format": "channels_last", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_41", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_41", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"size": [2, 2], "name": "up_sampling2d_10", "data_format": "channels_last", "trainable": true}, "class_name": "UpSampling2D"}, {"config": {"data_format": "channels_last", "filters": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [4, 4], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_42", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_42", "activation": "tanh", "trainable": true}, "class_name": "Activation"}], "name": "sequential_4", "class_name": "Sequential", "inbound_nodes": [[["input_5", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.2"}