{"config": {"name": "model_4", "input_layers": [["input_4", 0, 0]], "output_layers": [["dense_2", 0, 0]], "layers": [{"config": {"name": "input_4", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 256, 256, 3]}, "name": "input_4", "class_name": "InputLayer", "inbound_nodes": []}, {"config": [{"config": {"data_format": "channels_last", "filters": 64, "dtype": "float32", "batch_input_shape": [null, 256, 256, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "name": "conv2d_22", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_22", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_7", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_23", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_23", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_24", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_24", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_8", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_25", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_25", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_26", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_26", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_9", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_27", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_27", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_28", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_28", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_10", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_29", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_29", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_30", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_30", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_11", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_31", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_31", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "linear", "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_32", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_12", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}], "name": "sequential_3", "class_name": "Sequential", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"config": {"units": 1, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "activation": "sigmoid"}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["sequential_3", 1, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.2"}