{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"name": "sequential_1", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "conv2d_1", "dtype": "float32", "bias_regularizer": null, "filters": 64, "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "conv2d_2", "filters": 128, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "conv2d_3", "filters": 256, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "conv2d_4", "filters": 256, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "conv2d_5", "filters": 256, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "scale": true, "axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "conv2d_6", "filters": 256, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "conv2d_7", "filters": 256, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "conv2d_8", "filters": 256, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "conv2d_9", "filters": 256, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_5", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "name": "conv2d_10", "filters": 3, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_10", "activation": "tanh", "trainable": true}}], "inbound_nodes": [[["input_1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["sequential_1", 1, 0]]}, "keras_version": "2.1.2"}